<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-size: 24px}
-->
</style></head>

<body>
<p>C++&nbsp;es un&nbsp;lenguaje de programaci&oacute;n&nbsp;dise&ntilde;ado en 1979 por&nbsp;Bjarne Stroustrup. La intenci&oacute;n de su creaci&oacute;n fue extender al lenguaje de programaci&oacute;n&nbsp;C&nbsp;y a&ntilde;adir mecanismos que permiten la manipulaci&oacute;n de&nbsp;objetos. En ese sentido, desde el punto de vista de los&nbsp;lenguajes orientados a objetos, C++ es un lenguaje h&iacute;brido.</p>
<p>Posteriormente se a&ntilde;adieron facilidades de&nbsp;programaci&oacute;n gen&eacute;rica, que se sumaron a los paradigmas de&nbsp;programaci&oacute;n estructurada&nbsp;y&nbsp;programaci&oacute;n orientada a objetos. Por esto se suele decir que el C++ es un&nbsp;lenguaje de programaci&oacute;n multiparadigma.</p>
<p>Actualmente existe un est&aacute;ndar, denominado ISO C++, al que se han adherido la mayor&iacute;a de los fabricantes de compiladores m&aacute;s modernos. Existen tambi&eacute;n algunos int&eacute;rpretes, tales como ROOT.</p>
<p>El nombre &quot;C++&quot; fue propuesto por Rick Mascitti en el a&ntilde;o 1983, cuando el lenguaje fue utilizado por primera vez fuera de un laboratorio cient&iacute;fico. Antes se hab&iacute;a usado el nombre &quot;C con clases&quot;. En C++, la expresi&oacute;n &quot;C++&quot; significa &quot;incremento de C&quot; y se refiere a que C++ es una extensi&oacute;n de C.</p>
<p align="center"><img src="../YibramZarate/ISO_C++_Logo.svg.png" width="557" height="281" /></p>
<p><span class="style1">Caracter&iacute;sticas de C++</span></p>
<ul>
  <li>Su sintaxis es heredada del lenguaje C.</li>
  <li>Programa orientado a objetos (POO).</li>
  <li>Permite la agrupaci&oacute;n de instrucciones.</li>
  <li>Es port&aacute;til y tiene un gran n&uacute;mero de compiladores en diferentes plataformas y sistemas operativos.</li>
  <li>Permite la separaci&oacute;n de un programa en m&oacute;dulos que admiten compilaci&oacute;n independiente.</li>
  <li>Es un lenguaje de alto nivel.</li>
</ul>
<p class="style1">Ejemplos:</p>
<p>A continuaci&oacute;n, cita un programa de ejemplo &quot;Hola Mundo&quot; en C++</p>
<pre>/* Esta cabecera permite usar los objetos que encapsulan los descriptores stdout  y stdin: cout(&lt;&lt;) y cin(&gt;&gt;)*/
  #include &lt;iostream&gt;
    using namespace std;
    int main() 
 {      
cout &lt;&lt; &quot;Hola mundo&quot; &lt;&lt; endl; 
     return 0; 
 }

</pre>
<p>Al usar la directiva&nbsp;#include&nbsp;se le dice al compilador que busque e interprete todos los elementos definidos en el archivo que acompa&ntilde;a la directiva (en este caso,&nbsp;iostream). Para evitar sobrescribir los elementos ya definidos al ponerles igual nombre, se crearon los espacios de nombres o&nbsp;namespace&nbsp;del singular en ingl&eacute;s. En este caso hay un espacio de nombres llamado&nbsp;std, que es donde se incluyen las definiciones de todas las funciones y clases que conforman la&nbsp;<a href="https://es.wikipedia.org/wiki/Biblioteca_(inform%C3%A1tica)" title="Biblioteca (inform&aacute;tica)">biblioteca</a>&nbsp;est&aacute;ndar de C++. Al incluir la sentencia&nbsp;using namespace std&nbsp;le estamos diciendo al compilador que usaremos el espacio de nombres&nbsp;std&nbsp;por lo que no tendremos que incluirlo cuando usemos elementos de este espacio de nombres, como pueden ser los objetos&nbsp;cout&nbsp;y&nbsp;cin, que representan el flujo de salida est&aacute;ndar (t&iacute;picamente la pantalla o una ventana de texto) y el flujo de entrada est&aacute;ndar (t&iacute;picamente el teclado).</p>
<p>La definici&oacute;n de funciones es igual que en C, salvo por la caracter&iacute;stica de que si&nbsp;main&nbsp;no va a recoger argumentos, no tenemos por qu&eacute; pon&eacute;rselos, a diferencia de C, donde hab&iacute;a que ponerlos expl&iacute;citamente, aunque no se fueran a usar. Queda solo comentar que el s&iacute;mbolo&nbsp;&lt;&lt;&nbsp;se conoce como operador de inserci&oacute;n, y&nbsp;<em>grosso modo</em>&nbsp;est&aacute; enviando a&nbsp;cout&nbsp;lo que queremos mostrar por pantalla para que lo pinte, en este caso la cadena&nbsp;&quot;Hola mundo&quot;. El mismo operador&nbsp;&lt;&lt;&nbsp;se puede usar varias veces en la misma sentencia, de forma que gracias a esta caracter&iacute;stica podremos concatenar el objeto&nbsp;endl&nbsp;al final, cuyo resultado ser&aacute; imprimir un retorno de l&iacute;nea.</p>
<pre>&nbsp;
</pre>
<p>&nbsp;</p>
<p>&nbsp; </p>
<p>&nbsp;</p>
</body>
</html>
