<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-size: 24px}
-->
</style></head>

<body>
<p>Adobe Inc<strong>.</strong>&#8203; (pronunciado en ingl&eacute;s&nbsp;/&#601;&#712;do&#650;bi/) antes&nbsp;Adobe Systems Incorporated, es una empresa de&nbsp;software&nbsp;estadounidense con sede en&nbsp;San Jos&eacute;&nbsp;(California,&nbsp;EE. UU.) fundada en diciembre de 1982 por&nbsp;John Warnock&nbsp;y&nbsp;Charles Geschke. Destaca en el mundo del software por sus programas de edici&oacute;n de p&aacute;ginas web, v&iacute;deo e&nbsp;imagen digital&nbsp;hoy presentes en una integraci&oacute;n conocida como&nbsp;Adobe Creative Cloud&nbsp;o por su programa para ejecutar contenido multimedia&nbsp;Adobe Flash Player.<a href="https://es.wikipedia.org/wiki/Adobe_(empresa)#cite_note-Perfil_de_Adobe_Systems,_Inc._en_Downloads.com-3"></a>&#8203; Adobe desempe&ntilde;&oacute; un rol significativo en comenzar la revoluci&oacute;n de la autoedici&oacute;n cuando&nbsp;Apple Computer&nbsp;comenz&oacute; a utilizar&nbsp;PostScript&nbsp;para su l&iacute;nea de impresoras LaserWriter en 1985. </p>
<p align="center"><img src="../YibramZarate/Adobe_Systems_logo_and_wordmark.svg.png" width="532" height="246" /></p>
<p><span class="style1">Historia</span></p>
<p>Acrobat y el formato&nbsp;PDF&nbsp;tardaron en encontrar su lugar en el mercado, pero a medida que las aplicaciones iban integr&aacute;ndose las ventajas del PDF se fueron haciendo m&aacute;s evidentes y actualmente es el est&aacute;ndar en lo que a intercambio de documentos digitales se refiere.</p>
<p>Adobe no hab&iacute;a conseguido desarrollar una aplicaci&oacute;n de&nbsp;autoedici&oacute;n, por eso en 1994 adquiri&oacute;&nbsp;Aldus, que produc&iacute;a&nbsp;Pagemaker, para competir con&nbsp;QuarkXPress, pero esto no fue suficiente y en 1999 fue presentado&nbsp;Adobe InDesign, que progresivamente ha ido ocupando lugares antes exclusivos de Quark, hasta convertirse a d&iacute;a de hoy, en el software por referencia en autoedici&oacute;n de documentos.</p>
<p>En 2003, Adobe compr&oacute;&nbsp;Syntrillium Software&nbsp;el programa&nbsp;Cool Edit Pro, y lo mejor&oacute; en su versi&oacute;n&nbsp;Adobe Audition&nbsp;la cual actualmente compite con otros editores de audio de alto nivel, siendo uno de los m&aacute;s c&oacute;modos y completos.</p>
<p>En 2005, Adobe compr&oacute;&nbsp;Macromedia, conocida empresa de software distribuidora de los programas&nbsp;Flash,&nbsp;Dreamweaver,&nbsp;Director,&nbsp;Fireworks, y&nbsp;Freehand&nbsp;entre otros por 3.400 millones de d&oacute;lares (2.623 millones de euros) en acciones. Seg&uacute;n Adobe, la combinaci&oacute;n de ambas empresas potenciar&aacute; la compatibilidad entre sus productos como, por ejemplo,&nbsp;PDF&nbsp;y&nbsp;Flash.</p>
<p>Mediante esta compra, los planes de Adobe pasan por intentar potenciar el desarrollo y la colaboraci&oacute;n entre sus tecnolog&iacute;as, muy extendidas sobre todo en la Red. Los accionistas de Macromedia reciben 0,69 acciones de Adobe en un intercambio libre de impuestos, lo que supone un precio de 41,86 d&oacute;lares por cada acci&oacute;n seg&uacute;n la cotizaci&oacute;n de finales del 2006 y una prima del 25%. Los accionistas de Macromedia controlan aproximadamente el 18% del grupo resultante. El consejero delegado de Adobe,&nbsp;Bruce Chizen, que mantiene su cargo en el nuevo grupo, subray&oacute; que los clientes est&aacute;n demandando aplicaciones de&nbsp;software&nbsp;integradas que les permitan crear, gestionar y suministrar un amplio rango de contenidos y aplicaciones, y que la combinaci&oacute;n de ambas compa&ntilde;&iacute;as, junto a la &quot;funcionalidad complementaria&quot; de PDF y Flash, dar&aacute; a Adobe &quot;la oportunidad de dar vida a esta visi&oacute;n con una plataforma tecnol&oacute;gica con capacidad para definir la industria&quot;. El presidente y director ejecutivo de Adobe,&nbsp;Shantanu Narayen, mantiene su cargo, y el presidente y consejero delegado de Macromedia,&nbsp;Stephen Elop, pasa a formar parte del grupo como presidente mundial de operaciones.<a href="https://es.wikipedia.org/wiki/Adobe_(empresa)#cite_note-Empleado_de_Lucasfilm_demanda_a_Adobe_y_Otras_empresas_por_pactar_salarios-4"></a></p>
</body>
</html>
