<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-size: 24px}
-->
</style></head>

<body>
<p>HTML, acr&oacute;nimo en ingl&eacute;s de&nbsp;HyperText Markup Language&nbsp;(&laquo;lenguaje de marcado de hipertexto&raquo;), hace referencia al&nbsp;lenguaje de marcado&nbsp;utilizado en la creaci&oacute;n de&nbsp;p&aacute;ginas web. Este est&aacute;ndar que sirve de referencia del software que interact&uacute;a con la elaboraci&oacute;n de p&aacute;ginas web en sus diferentes versiones. Define una estructura b&aacute;sica y un c&oacute;digo (denominado c&oacute;digo HTML) para la presentaci&oacute;n de contenido de una p&aacute;gina web, que incluye texto, im&aacute;genes, videos, juegos, entre otros elementos. Este est&aacute;ndar es gestionado por el&nbsp;World Wide Web Consortium&nbsp;(W3C) o Consorcio WWW, una organizaci&oacute;n dedicada a la estandarizaci&oacute;n de la mayor&iacute;a de las tecnolog&iacute;as asociadas a la web, especialmente en lo relacionado con su escritura e interpretaci&oacute;n. HTML se considera el lenguaje web m&aacute;s importante y su invenci&oacute;n crucial para el surgimiento, desarrollo y expansi&oacute;n de la&nbsp;World Wide Web&nbsp;(WWW). Es el est&aacute;ndar que prevalece en la visualizaci&oacute;n de p&aacute;ginas web y es adoptado por todos los navegadores actuales.</p>
<p align="center"><img src="../YibramZarate/descarga (3).png" width="225" height="225" /></p>
<p>El lenguaje HTML se fundamenta en la diferenciaci&oacute;n como filosof&iacute;a de desarrollo. Para a&ntilde;adir elementos externos a una p&aacute;gina como im&aacute;genes, v&iacute;deos o&nbsp;<em>scripts</em>, no se incrustan directamente en el c&oacute;digo de la p&aacute;gina. En su lugar, se realiza una referencia a la ubicaci&oacute;n de cada elemento mediante texto. De este modo, la p&aacute;gina web contiene solamente texto, dejando al navegador web (int&eacute;rprete del c&oacute;digo) la labor de unir todos los elementos y visualizar la p&aacute;gina final. Al ser un est&aacute;ndar, HTML pretende ser un lenguaje que permita que cualquier p&aacute;gina web escrita en una determinada versi&oacute;n, pueda ser interpretada de manera uniforme (siguiendo el est&aacute;ndar) por cualquier navegador web actualizado.</p>
<p>HTML es un lenguaje de marcado que posibilita definir la estructura de nuestro documento mediante etiquetas. Este lenguaje ofrece una gran adaptabilidad, una estructuraci&oacute;n l&oacute;gica y es f&aacute;cil de interpre&shy;tar tanto por humanos como por m&aacute;quinas.</p>
<p>A lo largo de sus diferentes versiones, HTML ha experimentado la incorporaci&oacute;n y eliminaci&oacute;n de distintas caracter&iacute;sticas, con el prop&oacute;sito de optimizar su eficiencia y facilitar el desarrollo de p&aacute;ginas web compatibles con varios navegadores y plataformas (PC de escritorio, port&aacute;tiles,&nbsp;tel&eacute;fonos inteligentes,&nbsp;tabletas, etc.) No obstante, para interpretar adecuadamente una nueva versi&oacute;n de HTML, los desarrolladores de navegadores web deben incorporar estos cambios, y los usuarios debe ser capaces de usar la nueva versi&oacute;n del navegador con todas las actualizaciones aplicadas. Por lo general, estos cambios se implementan mediante actualizaciones autom&aacute;ticas (Firefox,&nbsp;Chrome) u ofreciendo una nueva versi&oacute;n del navegador con todas las modificaciones incorporadas, disponible en un sitio web de descarga oficial (Internet Explorer). En consecuencia, un navegador desactualizado no podr&aacute; interpretar de manera precisa una p&aacute;gina web escrita en una versi&oacute;n de HTML superior a la que soporta, lo que obliga a menudo a los desarrolladores a aplicar t&eacute;cnicas y cambios para resolver problemas de visualizaci&oacute;n e incluso de interpretaci&oacute;n de c&oacute;digo HTML.</p>
<p>As&iacute; mismo, las p&aacute;ginas web creadas en una versi&oacute;n anterior de HTML deber&iacute;an ser actualizadas o reescritas, aunque esto no siempre se cumple. Por esta raz&oacute;n, algunos navegadores todav&iacute;a conservan la capacidad de interpretar p&aacute;ginas web en versiones anteriores de HTML. Estas diferencias en la interpretaci&oacute;n de una p&aacute;gina web persisten debido a estas razones, generando discrepancias entre distintos navegadores y versiones.</p>
<p><span class="style1">Primeras especificaciones de HTML</span></p>
<p>Tim Berners-Lee, en 1991, describe 18 elementos que conformaban el dise&ntilde;o inicial y relativamente simple de HTML. Trece de estos elementos a&uacute;n perduran en HTML 4.</p>
<p>Berners-Lee consideraba el HTML una ampliaci&oacute;n de&nbsp;SGML, pero no fue formalmente reconocida como tal hasta la publicaci&oacute;n a mediados de 1993, cuando la&nbsp;IETF&nbsp;(en espa&ntilde;ol: Grupo de Trabajo de Ingenier&iacute;a de Internet)<a href="https://es.wikipedia.org/wiki/HTML#cite_note-borrador_ietf-5"></a>&#8203; public&oacute; una primera propuesta para la especificaci&oacute;n de HTML: el borrador del&nbsp;<em>Hypertext Markup Language</em>&nbsp;de Berners-Lee y&nbsp;Dan Connolly. Esta propuesta inclu&iacute;a una&nbsp;Definici&oacute;n de Tipo de Documento&nbsp;SGML para establecer la sintaxis.A pesar de que el borrador expir&oacute; a los seis meses, fue notable por reconocer la etiqueta espec&iacute;fica del navegador&nbsp;Mosaic&nbsp;usada para insertar im&aacute;genes sin cambiar la l&iacute;nea. Esto reflejaba la filosof&iacute;a del IETF de basar los est&aacute;ndares en prototipos con &eacute;xito.<a href="https://es.wikipedia.org/wiki/HTML#cite_note-raymond-7"> </a>&#8203;De manera similar, el borrador competidor de&nbsp;Dave Raggett&nbsp;<em>HTML+ (Hypertext Markup Format)</em>&nbsp;(Formato de Marcaje de Hipertexto), de finales de 1993, suger&iacute;a estandarizar caracter&iacute;sticas ya implementadas, como las tablas.</p>
<p><span class="style1">Marcador HTML</span></p>
<p>El HTML se escribe utilizando &laquo;etiquetas&raquo;, encerradas por&nbsp;corchetes angulares&nbsp;(&lt;,&gt;,/). Adem&aacute;s de describir la estructura de un documento, el HTML puede, hasta cierto punto, definir su apariencia y hacer referencia a un tipo de programa llamado&nbsp;<em>script</em>, el cual puede influir en el comportamiento de&nbsp;navegadores web&nbsp;y otros procesadores de HTML.<a href="https://es.wikipedia.org/wiki/HTML#cite_note-9">9</a>&#8203;</p>
<p>El t&eacute;rmino HTML, tambi&eacute;n se refiere al contenido del&nbsp;tipo de MIME&nbsp;text/html&nbsp;o de manera m&aacute;s amplia, como un t&eacute;rmino gen&eacute;rico para el HTML. Esto puede ser en forma derivada del&nbsp;XML&nbsp;(como&nbsp;XHTML&nbsp;1.0 y versiones posteriores) o directamente derivado de&nbsp;SGML&nbsp;(como HTML 4.01 y versiones anteriores). El HTML consta de varios componentes esenciales, incluyendo&nbsp;elementos&nbsp;y sus&nbsp;atributos,&nbsp;tipos de datos&nbsp;y la&nbsp;declaraci&oacute;n de tipo de documento.</p>
<p>&nbsp;</p>
</body>
</html>
