<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p>Microsoft Access&nbsp;es un&nbsp;sistema de gesti&oacute;n de bases de datos&nbsp;incluido en las ediciones profesionales de la suite&nbsp;Microsoft Office. Es el sucesor de&nbsp;<em>Embedded Basic.</em></p>
<p>Access es un gestor de datos que utiliza los conceptos de&nbsp;bases de datos relacionales&nbsp;y pueden manejarse por medio de consultas e informes. Est&aacute; adaptado para recopilar datos de otras utilidades como&nbsp;Excel,&nbsp;SharePoint, etc.</p>
<p>La aplicaci&oacute;n permite recopilar informaci&oacute;n relativa a un asunto o prop&oacute;sito particular, como el seguimiento de pedidos de clientes o el mantenimiento de una colecci&oacute;n de m&uacute;sica, videojuegos,&nbsp;huso horario, etc.</p>
<p align="center"><img src="../YibramZarate/descarga.jpg" alt="" width="227" height="222" /></p>
<p>Muy sencillo de utilizar, es un programa con una base de datos que se utiliza para guardar informaci&oacute;n importante en diferentes casos.</p>
<p>Fue llamado EB (<em>&quot;Embedded Basic&quot;</em>), nombre que se utilizar&iacute;a en la mayor&iacute;a de software Microsoft hasta la llegada de VBA. Tambi&eacute;n se buscaba que Omega funcionara como&nbsp;<em>front-end</em>&nbsp;para&nbsp;Microsoft SQL Server. Omega requer&iacute;a una enorme cantidad de recursos de los procesadores&nbsp;386&nbsp;disponibles en la &eacute;poca para usos comerciales, retrasando su llegada desde el primer cuatrimestre de 1990 hasta enero de 1991. M&aacute;s tarde partes del proyecto fueron utilizados para otros proyectos de Microsoft. Cirrus (nombre clave para Access) y Thunder (nombre clave para Visual Basic, en el que NO SE UTILIZO se utiliz&oacute; el motor&nbsp;<em>Embedded Basic</em>). Tras el adelanto de Access, Omega fue demostrado ante varios periodistas en 1992 y Access presentaba funciones que no ten&iacute;a.</p>
<p>Despu&eacute;s de la cancelaci&oacute;n de Omega, algunos de sus desarrolladores fueron asignados al proyecto Cirrus (la mayor&iacute;a fue a parar al equipo creador de Visual Basic). Su meta era crear un competidor de productos como&nbsp;dBase&nbsp;y&nbsp;Paradox&nbsp;en el entorno Windows. El proyecto pareci&oacute; condenado con la compra de&nbsp;FoxPro&nbsp;(una&nbsp;<em>app</em>&nbsp;de base de datos completamente diferente a Access) por parte de Microsoft, pero la compa&ntilde;&iacute;a decidi&oacute; continuar con el desarrollo de Cirrus. Al principio se asumi&oacute; que el producto usar&iacute;a el motor&nbsp;<em>Extensible Storage Engine</em>&nbsp;(<em>Jet Blue</em>) pero al final fue reemplazado por otro motor llamado&nbsp;<em>Microsoft Jet Database Engine</em>&nbsp;(Jet Red). El proyecto us&oacute; partes del c&oacute;digo escrito para Omega y una versi&oacute;n pre-publicada de Visual Basic. En julio de 1992, lleg&oacute; la versi&oacute;n final con el nombre de Access que contin&uacute;a hasta el momento.</p>
</body>
</html>
