<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p>CSS&nbsp;(siglas en ingl&eacute;s de&nbsp;Cascading&nbsp;Style&nbsp;<strong>S</strong>heets), en espa&ntilde;ol &laquo;Hojas de estilo en cascada&raquo;, es un lenguaje de&nbsp;dise&ntilde;o gr&aacute;fico&nbsp;para definir y crear la presentaci&oacute;n de un documento estructurado escrito en un&nbsp;lenguaje de marcado.<a href="https://es.wikipedia.org/wiki/CSS#cite_note-2"></a>&#8203; Es muy usado para establecer el dise&ntilde;o visual de los documentos web, e interfaces de usuario escritas en&nbsp;HTML&nbsp;o&nbsp;XHTML; el lenguaje puede ser aplicado a cualquier&nbsp;documento XML, incluyendo XHTML,&nbsp;SVG,&nbsp;XUL,&nbsp;RSS, etc&eacute;tera. Junto con&nbsp;HTML&nbsp;y&nbsp;JavaScript, CSS es una&nbsp;tecnolog&iacute;a&nbsp;usada por muchos&nbsp;sitios web&nbsp;para crear p&aacute;ginas visualmente atractivas,&nbsp;interfaces&nbsp;de usuario para&nbsp;aplicaciones web&nbsp;y&nbsp;GUIs&nbsp;para muchas aplicaciones&nbsp;m&oacute;viles&nbsp;(como&nbsp;Firefox&nbsp;OS).</p>
<p align="center"><img src="../YibramZarate/descarga.png" width="189" height="267" /></p>
<p>CSS est&aacute; dise&ntilde;ado principalmente para marcar la separaci&oacute;n del contenido del documento y la forma de presentaci&oacute;n de este, caracter&iacute;sticas tales como las capas o&nbsp;<em>layouts</em>, los colores y las fuentes. Esta separaci&oacute;n busca mejorar la accesibilidad del documento, proveer m&aacute;s flexibilidad y control en la especificaci&oacute;n de caracter&iacute;sticas presentacionales, permitir que varios documentos&nbsp;HTML&nbsp;compartan un mismo estilo usando una sola hoja de estilos separada en un archivo&nbsp;.css, y reducir la complejidad y la repetici&oacute;n de c&oacute;digo en la estructura del documento.</p>
<p>La separaci&oacute;n del formato y el contenido hace posible presentar el mismo documento marcado en diferentes estilos para diferentes m&eacute;todos de renderizado, como en pantalla, en impresi&oacute;n, en voz (mediante un navegador de voz o un lector de pantalla), y dispositivos t&aacute;ctiles basados en el&nbsp;sistema Braille. Tambi&eacute;n se puede mostrar una p&aacute;gina web de manera diferente dependiendo del tama&ntilde;o de la pantalla o tipo de dispositivo. Los lectores pueden especificar una hoja de estilos diferente, como una hoja de estilos CSS guardado en su computadora, para sobreescribir la hoja de estilos del dise&ntilde;ador.</p>
<p>La especificaci&oacute;n CSS describe un esquema prioritario para determinar qu&eacute; reglas de estilo se aplican si m&aacute;s de una regla coincide para un elemento en particular. Estas reglas son aplicadas con un sistema llamado&nbsp;<em>de cascada</em>, de modo que las prioridades son calculadas y asignadas a las reglas, as&iacute; que los resultados son predecibles.</p>
<p>La especificaci&oacute;n CSS es mantenida por el&nbsp;World Wide Web Consortium (W3C). El&nbsp;MIME type&nbsp;text/css&nbsp;est&aacute; registrado para su uso por CSS descrito en el&nbsp;RFC 2318.<a href="https://es.wikipedia.org/wiki/CSS#cite_note-5"></a>&#8203; El W3C proporciona una herramienta de validaci&oacute;n de CSS gratuita para los documentos CSS.</p>
<p>&nbsp;</p>
</body>
</html>
