<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
.style1 {font-size: 24px}
-->
</style></head>

<body>
<p>El&nbsp;Consorcio WWW, en ingl&eacute;s:&nbsp;<em>World Wide Web Consortium</em>&nbsp;(W3C), es un&nbsp;consorcio&nbsp;internacional que genera recomendaciones y&nbsp;est&aacute;ndares&nbsp;que aseguran el crecimiento de la&nbsp;<em>World Wide Web</em>&nbsp;a largo plazo.</p>
<p>Este consorcio fue creado en octubre de 1994,<a href="https://es.wikipedia.org/wiki/World_Wide_Web_Consortium#cite_note-org-4"></a>&#8203; y est&aacute; dirigido por&nbsp;Tim Berners-Lee, el creador original del&nbsp;URL&nbsp;(<em>Uniform Resource Locator</em>, Localizador Uniforme de Recursos), del&nbsp;HTTP&nbsp;(<em>HyperText Transfer Protocol</em>, Protocolo de Transferencia de HiperTexto) y del&nbsp;HTML&nbsp;(<em>Hyper Text Markup Language</em>,&nbsp;Lenguaje de Marcado&nbsp;de HiperTexto), que son las principales tecnolog&iacute;as sobre las que se basa la Web.</p>
<p align="center"><img src="../YibramZarate/W3C®_Icon.svg.png" width="594" height="257" /></p>
<p><span class="style1">Organizaci&oacute;n de la W3C</span></p>
<p>El W3C fue creado el 1 de octubre de 1994, por&nbsp;Tim Berners-Lee&nbsp;en el&nbsp;Instituto Tecnol&oacute;gico de Massachusetts&nbsp;(MIT),<a href="https://es.wikipedia.org/wiki/World_Wide_Web_Consortium#cite_note-org-4"></a>&#8203; actual sede central del consorcio. Posteriormente se unen, en abril de 1995,&nbsp;INRIA&nbsp;en&nbsp;Francia&nbsp;como el hu&eacute;sped europeo, que fue reemplazado por el&nbsp;ERCIM&nbsp;en 2003, y en septiembre de 1995, la&nbsp;Universidad de Kei&#333;&nbsp;(Shonan Fujisawa Campus) en&nbsp;Jap&oacute;n&nbsp;como hu&eacute;sped asi&aacute;tico. Estos organismos administran el W3C, que est&aacute; integrado por:</p>
<ul>
  <li>Miembros: a abril de 2010 contaba con 330 miembros.</li>
  <li>Equipo (<em>W3C Team</em>): 65 investigadores y expertos de todo el mundo.</li>
  <li>Oficinas (<em>W3C Offices</em>): centros regionales establecidos en Alemania y Austria (oficina conjunta), Australia,&nbsp;Benelux&nbsp;(oficina conjunta), China,&nbsp;Corea del Sur, Espa&ntilde;a, Finlandia, Grecia, Hong Kong, Hungr&iacute;a, India, Israel, Italia, Marruecos, Suecia y Reino Unido e Irlanda (oficina conjunta).</li>
</ul>
<p>La oficina espa&ntilde;ola del W3C, establecida en 2003, est&aacute; albergada por la Fundaci&oacute;n CTIC en el&nbsp;Parque Cient&iacute;fico Tecnol&oacute;gico de Gij&oacute;n&nbsp;(Principado de Asturias).</p>
<p><span class="style1">Maduraci&oacute;n de especificaciones</span></p>
<p>A veces, cuando una especificaci&oacute;n se hace demasiado grande, se divide en m&oacute;dulos independientes que pueden madurar a su propio ritmo. Ediciones posteriores de un m&oacute;dulo o especificaci&oacute;n se conocen como niveles y se denotan por el primer n&uacute;mero entero en el t&iacute;tulo (por ejemplo CSS3 = Nivel 3). Las revisiones posteriores en cada nivel se indican mediante un n&uacute;mero entero despu&eacute;s de un punto decimal (por ejemplo CSS2.1 = Revisi&oacute;n 1).</p>
<p>El proceso de formaci&oacute;n de est&aacute;ndar del W3C se define en el documento de proceso de W3C, que presenta cuatro niveles de madurez a trav&eacute;s del cual cada nueva norma o recomendaci&oacute;n deben progresar.</p>
<p><span class="style1">Borrador de Trabajo (WD)</span></p>
<p>Despu&eacute;s de que suficiente contenido ha sido recopilado por el 'editor de borradores' y de la discusi&oacute;n, puede ser publicado como borrador de trabajo (WD, del ingl&eacute;s&nbsp;<em>Working Draft</em>) para su revisi&oacute;n por la comunidad. Un documento WD es la primera forma de un est&aacute;ndar que est&aacute; disponible p&uacute;blicamente. Comentarios de pr&aacute;cticamente cualquier persona son aceptados, aunque no se hacen promesas con respecto a actuar sobre alg&uacute;n elemento en particular comentado.</p>
<p>En esta etapa, el modelo de documento puede tener diferencias significativas respecto a su forma final. Como tal, cualquier persona que implementa est&aacute;ndares WD deben estar dispuestos a modificar significativamente sus implementaciones como el est&aacute;ndar madura.</p>
<p><span class="style1">Recomendaci&oacute;n Candidata (CR)</span></p>
<p>Una recomendaci&oacute;n candidata (en ingl&eacute;s:&nbsp;<em>Candidate recommendation</em>) es una versi&oacute;n de una norma que es m&aacute;s madura que el WD. En este punto, el grupo responsable de la norma est&aacute; convencido de que la norma cumple con su objetivo. El prop&oacute;sito de la CR es obtener ayuda de la comunidad de desarrollo en cuanto a la implementaci&oacute;n de la norma.</p>
<p>El documento est&aacute;ndar puede cambiar a&uacute;n m&aacute;s, pero en este momento, se decidi&oacute; en su mayor&iacute;a caracter&iacute;sticas significativas. El dise&ntilde;o de estas caracter&iacute;sticas a&uacute;n puede cambiar debido a los comentarios de los ejecutores conforme el est&aacute;ndar madura.</p>
<p><span class="style1">Recomendaci&oacute;n Propuesta (PR)</span></p>
<p>Una recomendaci&oacute;n propuesta (en ingl&eacute;s:&nbsp;<em>Proposed recommendation</em>) es la versi&oacute;n de una norma que ha pasado los dos niveles anteriores. Los usuarios de la norma proporcionan entrada. En esta etapa, el documento se present&oacute; al Consejo Asesor del W3C para su aprobaci&oacute;n final.</p>
<p>Si bien este paso es importante, rara vez causa cambios significativos en un est&aacute;ndar a medida que pasa a la siguiente fase.</p>
<p>Tanto candidatos y propuestas pueden entrar en &quot;&uacute;ltima llamada&quot; para indicar cualquier informaci&oacute;n adicional que deba ser tenida en cuenta.</p>
<p><span class="style1">Recomendaci&oacute;n de W3C (REC)</span></p>
<p>Una recomendaci&oacute;n de W3C &nbsp;(en ingl&eacute;s:&nbsp;<em>W3C recommendation</em>) es la etapa m&aacute;s madura de desarrollo. En este punto, la norma ha sido objeto de amplia revisi&oacute;n y pruebas, tanto en condiciones te&oacute;ricas y pr&aacute;cticas. La norma est&aacute; respaldada por el W3C, lo que indica su disposici&oacute;n para su despliegue al p&uacute;blico, y fomentar un apoyo m&aacute;s generalizado entre los ejecutores y los autores.</p>
<p>Recomendaciones a veces se pueden implementar de forma incorrecta, en parte, o nada en absoluto, pero muchas normas definen dos o m&aacute;s niveles de conformidad que deben seguir los desarrolladores si se desean etiquetar su producto como compatible con W3C.</p>
<p><span class="style1">Revisiones posteriores </span></p>
<p>Una recomendaci&oacute;n puede ser actualizada o ampliada por separado por erratas publicadas o por edici&oacute;n de borradores no t&eacute;cnicos. Hasta que haya suficientes cambios sustanciales se acumulan para producir una nueva edici&oacute;n o nivel de la recomendaci&oacute;n. Adem&aacute;s, el W3C publica diversos tipos de notas informativas que se van a utilizar como referencias.</p>
<p><span class="style1">Certificaci&oacute;n</span></p>
<p>A diferencia de la ISOC y otros organismos de normalizaci&oacute;n internacionales, el W3C no tiene un programa de certificaci&oacute;n. El W3C ha decidido, por ahora, que no es adecuado para iniciar un programa de este tipo, debido al riesgo de crear m&aacute;s inconvenientes para la comunidad que beneficios.</p>
<p><span class="style1">Cr&iacute;ticas</span></p>
<p>En 2012 y 2013, el W3C empez&oacute; a considerar la inclusi&oacute;n de algunos&nbsp;Encrypted Media Extensions&nbsp;(EME) para DRM en HTML5, lo que ha sido criticado por estar en contra de la neutralidad e&nbsp;interoperabilidad, que distingue a los sitios construidos usando solo est&aacute;ndares del W3C sin incluir&nbsp;plugins&nbsp;propietarios como&nbsp;Flash.</p>
</body>
</html>
