<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p><strong>Adobe Flash</strong>&nbsp;(anteriormente&nbsp;<strong>Macromedia Flash</strong>&nbsp;y&nbsp;<strong>FutureSplash</strong>) es una plataforma de software&nbsp;multimedia utilizada para la producci&oacute;n de&nbsp;animaciones,&nbsp;aplicaciones web enriquecidas,&nbsp;aplicaciones de escritorio,&nbsp;aplicaciones m&oacute;viles,&nbsp;juegos m&oacute;viles&nbsp;y reproductores de video de navegador web integrados. Flash muestra texto,&nbsp;gr&aacute;ficos vectoriales&nbsp;y&nbsp;gr&aacute;ficos de trama&nbsp;para proporcionar animaciones, videojuegos y aplicaciones. Permite la transmisi&oacute;n de&nbsp;audio y video, y puede capturar la entrada del mouse, teclado, micr&oacute;fono y c&aacute;mara.</p>
<p align="center"><img src="../YibramZarate/descarga (1).png" width="227" height="222" /></p>
<p>Los artistas&nbsp;pueden producir gr&aacute;ficos y animaciones Flash utilizando&nbsp;Adobe Animate&nbsp;(anteriormente conocido como Adobe Flash Professional).&nbsp;Los desarrolladores de software&nbsp;pueden producir aplicaciones y videojuegos utilizando&nbsp;Adobe Flash Builder, FlashDevelop, Flash Catalyst o cualquier editor de texto combinado con&nbsp;Apache Flex&nbsp;SDK. Los usuarios finales ven contenido Flash a trav&eacute;s de&nbsp;Flash Player&nbsp;(para navegadores web),&nbsp;Adobe AIR&nbsp;(para&nbsp;aplicaciones m&oacute;viles&nbsp;o de escritorio) o reproductores de terceros como&nbsp;Scaleform&nbsp;(para videojuegos). Adobe Flash Player (que est&aacute; disponible en&nbsp;Microsoft Windows,&nbsp;macOS&nbsp;y&nbsp;Linux) permite a los usuarios finales ver contenido Flash mediante&nbsp;navegadores web.&nbsp;Adobe Flash Lite&nbsp;permit&iacute;a ver contenido Flash en&nbsp;tel&eacute;fonos inteligentes&nbsp;m&aacute;s antiguos, pero desde entonces fue descontinuado y reemplazado por Adobe AIR.</p>
<p>El lenguaje de programaci&oacute;n&nbsp;ActionScript&nbsp;permite el desarrollo de animaciones interactivas, videojuegos, aplicaciones web, aplicaciones de escritorio y aplicaciones m&oacute;viles. Los programadores pueden implementar software Flash utilizando un IDE como Adobe Animate, Adobe Flash Builder,&nbsp;Adobe Director, FlashDevelop y Powerflasher FDT. Adobe AIR permite desarrollar aplicaciones m&oacute;viles y de escritorio con todas las funciones con Flash y publicarlas para&nbsp;Windows,&nbsp;macOS,&nbsp;Android,&nbsp;iOS,&nbsp;Xbox One,&nbsp;PlayStation 4,&nbsp;Wii U&nbsp;y&nbsp;Nintendo Switch.</p>
<p>Flash se utiliz&oacute; inicialmente para crear sitios web totalmente interactivos, pero este enfoque se elimin&oacute; con la introducci&oacute;n de&nbsp;HTML5. En cambio, Flash encontr&oacute; un nicho como la plataforma dominante para el contenido multimedia en l&iacute;nea, particularmente para&nbsp;los juegos de navegador. Despu&eacute;s de una carta abierta escrita por Steve Jobs en 2010 que dec&iacute;a que no aprobar&iacute;a el uso de Flash en los dispositivos&nbsp;iOS&nbsp;de&nbsp;Apple&nbsp;debido a numerosas fallas de seguridad, el uso de Flash disminuy&oacute; cuando Adobe hizo la transici&oacute;n a la plataforma Adobe Air. Flash Player qued&oacute; obsoleto en 2017 y oficialmente descontinuado a fines de 2020 para todos los usuarios fuera de China, as&iacute; como para usuarios no empresariales,&#8203; con muchos navegadores web y sistemas operativos programados para eliminar el software Flash Player casi al mismo tiempo. Adobe contin&uacute;a desarrollando Adobe Animate, que admite est&aacute;ndares web como HTML5 en lugar del formato Flash.</p>
</body>
</html>
